In [3]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
               'data1':np.random.randint(100,200,5),
               'data2' : np.random.randint(200,300)})

In [6]:
df

  key1  data1  data2
0    a    108    263
1    a    117    263
2    b    166    263
3    b    126    263
4    a    193    263

In [7]:
df.groupby('key1').sum()

      data1  data2
key1
a       418    789
b       292    526

In [8]:
df.groupby('key1').count()

      data1  data2
key1
a         3      3
b         2      2

In [9]:
df.info

<bound method DataFrame.info of   key1  data1  data2
0    a    108    263
1    a    117    263
2    b    166    263
3    b    126    263
4    a    193    263>

In [10]:
df.describe

<bound method NDFrame.describe of   key1  data1  data2
0    a    108    263
1    a    117    263
2    b    166    263
3    b    126    263
4    a    193    263>

In [11]:
df['key2']=['one','two','one','two','one']
df

  key1  data1  data2 key2
0    a    108    263  one
1    a    117    263  two
2    b    166    263  one
3    b    126    263  two
4    a    193    263  one

In [13]:
grouped = df.groupby(['key1','key2'])

In [14]:
grouped.first()

           data1  data2
key1 key2
a    one     108    263
     two     117    263
b    one     166    263
     two     126    263